//refer https://alanhere.com/2019/06/11/sina-stock-api/
//沪深股市
//HTTP 请求方式：GET
//http://hq.sinajs.cn/list=<PRE><SYMBOL>

//Request http://hq.sinajs.cn/list=sh600030
//Response: var hq_str_sh600030=
/*"
中信证券,
28.870,
28.810,
28.750,
28.960,
28.560,
28.750,
28.770,
36790551,
10581841---
28.000,
400,
28.750,
4000,
28.740,
12300,
28.730,
22263,
28.720,
34200,
28.710,
4500,
28.770,
13300,
28.780,
7100,
28.790,
26700,
28.800,
13900,
28.810,
2020-12-16,
11:30:00,
00,";
*/
/*
序号	示例	说明
0	中信证券	股票（指数）名称
1	20.080	今日开盘
2	20.080	昨日收盘
3	21.090	最新价格
4	21.160	今日最高
5	20.040	今日最低
6	21.090	竞买价，即“买一”报价
7	21.100	竞卖价，即“卖一”报价
8	221743961	成交量
9	4597038936.000	成交额
10	851863	“买一”报价股数，即约 8519 手
11	21.090	“买一”报价
12-19	……	“买二”至“买五”报价
20-29	……	“卖一”至“卖五”报价
30	2019-06-11	日期
31	15:00:00	时间
32	00	好像收盘后会出现这个标签
*/

//港股
//HTTP 请求方式：GET
//http://hq.sinajs.cn/list=hk<SYMBOL>
//http://hq.sinajs.cn/list=hk00728
//response var hq_str_hk00728="CHINA TELECOM,中国电信,2.190,2.140,2.220,2.150,2.170,0.030,1.402,2.170,2.180,227593351,104187897,60.278,0.000,3.316,2.007,2020/12/16,15:10";

//美股
//HTTP 请求方式：GET
//http://hq.sinajs.cn/list=gb_<SYMBOL>
//http://hq.sinajs.cn/list=gb_bam
//var hq_str_gb_bam="布鲁克菲尔德资产管理,41.2300,1.53,2020-12-16 09:30:12,0.6200,40.9800,41.2900,40.5300,45.6067,21.5733,1268252,2113085,62304301086,-0.05,--,0.00,0.00,0.12,0.00,1511139973,59,41.2300,0.00,0.00,Dec 15 04:57PM EST,Dec 15 04:00PM EST,40.6100,33024,1,2020,51963772.0000,41.2300,41.2300,1361579.5200";
/*
0	  哔哩哔哩	        股票名称
1	  15.0600	          最新价格
2	  1.176	            涨跌幅
3	  2019-06-11 09:31:51	日期与时间
4	0.2600	涨跌额
5	14.9100	今日开盘
6	15.3100	今日最高
7	14.8800	今日最低
8	22.7000	52周最高
9	9.0900	52周最低
10	3584557	成交量
11-27	……	……
*/

//英国富时100，德国 DAX，法国 CAC40 这些指数可以通过如下方式请求：
//HTTP 请求方式：GET
//http://hq.sinajs.cn/list=b_<SYMBOL>

